experiments/results/logs/periodic-hpa-001/wrk2.txt
Running 10m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 5611.415ms, rate sampling interval: 16367ms
  Thread calibration: mean lat.: 5499.486ms, rate sampling interval: 15876ms
  Thread calibration: mean lat.: 5281.280ms, rate sampling interval: 15073ms
  Thread calibration: mean lat.: 5377.170ms, rate sampling interval: 15884ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.58m     1.79m    7.21m    70.27%
    Req/Sec     6.66      3.28    13.00     79.19%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.15m 
 75.000%    5.85m 
 90.000%    6.44m 
 99.000%    7.06m 
 99.900%    7.17m 
 99.990%    7.21m 
 99.999%    7.21m 
100.000%    7.21m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9093.119     0.000000            2         1.00
   88604.671     0.100000         1699         1.11
  180092.927     0.200000         3391         1.25
  249167.871     0.300000         5087         1.43
  285999.103     0.400000         6789         1.67
  308805.631     0.500000         8492         2.00
  317194.239     0.550000         9328         2.22
  325844.991     0.600000        10180         2.50
  334233.599     0.650000        11029         2.86
  342360.063     0.700000        11902         3.33
  351010.815     0.750000        12718         4.00
  355991.551     0.775000        13143         4.44
  361234.431     0.800000        13575         5.00
  367001.599     0.825000        13991         5.71
  372768.767     0.850000        14414         6.67
  379060.223     0.875000        14845         8.00
  382730.239     0.887500        15049         8.89
  386662.399     0.900000        15271        10.00
  390594.559     0.912500        15484        11.43
  395051.007     0.925000        15686        13.33
  399769.599     0.937500        15899        16.00
  402391.039     0.943750        16019        17.78
  405274.623     0.950000        16112        20.00
  407896.063     0.956250        16221        22.86
  410779.647     0.962500        16331        26.67
  413663.231     0.968750        16434        32.00
  415236.095     0.971875        16488        35.56
  416546.815     0.975000        16533        40.00
  418119.679     0.978125        16593        45.71
  419692.543     0.981250        16643        53.33
  420741.119     0.984375        16691        64.00
  421527.551     0.985938        16718        71.11
  422576.127     0.987500        16745        80.00
  423362.559     0.989062        16774        91.43
  424148.991     0.990625        16807       106.67
  424935.423     0.992188        16826       128.00
  425459.711     0.992969        16836       142.22
  426246.143     0.993750        16853       160.00
  426770.431     0.994531        16873       182.86
  427032.575     0.995313        16885       213.33
  427294.719     0.996094        16897       256.00
  427294.719     0.996484        16897       284.44
  427556.863     0.996875        16903       320.00
  427819.007     0.997266        16909       365.71
  428343.295     0.997656        16920       426.67
  428605.439     0.998047        16925       512.00
  428867.583     0.998242        16929       568.89
  428867.583     0.998437        16929       640.00
  429391.871     0.998633        16934       731.43
  429916.159     0.998828        16940       853.33
  429916.159     0.999023        16940      1024.00
  430178.303     0.999121        16945      1137.78
  430178.303     0.999219        16945      1280.00
  430178.303     0.999316        16945      1462.86
  430440.447     0.999414        16946      1706.67
  430702.591     0.999512        16948      2048.00
  430702.591     0.999561        16948      2275.56
  430964.735     0.999609        16951      2560.00
  430964.735     0.999658        16951      2925.71
  430964.735     0.999707        16951      3413.33
  430964.735     0.999756        16951      4096.00
  432275.455     0.999780        16952      4551.11
  432275.455     0.999805        16952      5120.00
  432537.599     0.999829        16953      5851.43
  432537.599     0.999854        16953      6826.67
  432537.599     0.999878        16953      8192.00
  432799.743     0.999890        16955      9102.22
  432799.743     1.000000        16955          inf
#[Mean    =   274835.602, StdDeviation   =   107625.060]
#[Max     =   432537.600, Total count    =        16955]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  17152 requests in 10.00m, 175.87MB read
  Socket errors: connect 0, read 0, write 0, timeout 13096
Requests/sec:     28.58
Transfer/sec:    300.06KB